In [1]:
import numpy as np
import pandas as pd #불러오는데 오래 걸림

In [9]:
# Series 생성
obj = pd.Series([-1, 3, 6, 8, 9], index=["a", "b", "c", "d", "e"])
obj

a   -1
b    3
c    6
d    8
e    9
dtype: int64

In [8]:
#Dictionary를 이용한 Series 생성
dict = {"seoul" : 1000, "pusan" : 2000, "suwon" : 3000}
s = pd.Series(dict)
s.name = "price_per_region"
s.index.name ="region"
s

region
pusan    2000
seoul    1000
suwon    3000
Name: price_per_region, dtype: int64

In [10]:
dict = {"seoul" : 1000, "pusan" : 2000, "suwon" : 3000}
s = pd.Series(dict)

In [43]:
# DataFrame
data = {"names" : ["kim", "kim", "lee", "park", "lee"],
       "year" : [2015, 2016, 2017, 2015, 2015],
       "points" : [1.5, 2.7, 1.3, 2.6, 3.0]}

df = pd.DataFrame(data,
                 columns=["year", "names", "points", "grade"],
                 index=["one", "two", "three", "four", "five"])
df.values

#df.index.name = "sNum"
#df.columns.name = "sInfo"
df[["names", "year"]]

df["grade"] = ["A", "B", "C", "A", "A"]
df["double_points"] = df["points"] * 2
df["hi_points"] = df["points"] > 2.5
del df["grade"]
df

df.drop("hi_points", axis=1)
# 1차원에서는 0 : 오른쪽 방향
# 2차원에서는 0, 1 : 0은 행방향 1은 열방향
# 3차원에서는 0, 1, 2 : 0은 깊이, 1은 행방향, 2는 열방향

       year names  points  double_points
one    2015   kim     1.5            3.0
two    2016   kim     2.7            5.4
three  2017   lee     1.3            2.6
four   2015  park     2.6            5.2
five   2015   lee     3.0            6.0

In [53]:
# DataFrame
data = {"names" : ["kim", "kim", "lee", "park", "lee"],
       "year" : [2015, 2016, 2017, 2015, 2015],
       "points" : [1.5, 2.7, 1.3, 2.6, 3.0]}

df = pd.DataFrame(data,
                 columns=["year", "names", "points", "grade"],
                 index=["one", "two", "three", "four", "five"])

# row indexing
#df[0:2]
df.loc["one":"three", "names":"grade"]

      names  points grade
one     kim     1.5   NaN
two     kim     2.7   NaN
three   lee     1.3   NaN

In [56]:
# DataFrame
data = {"names" : ["kim", "kim", "lee", "park", "lee"],
       "year" : [2015, 2016, 2017, 2015, 2015],
       "points" : [1.5, 2.7, 1.3, 2.6, 3.0]}

df = pd.DataFrame(data,
                 columns=["year", "names", "points", "grade"],
                 index=["one", "two", "three", "four", "five"])

df.drop("one")

       year names  points grade
two    2016   kim     2.7   NaN
three  2017   lee     1.3   NaN
four   2015  park     2.6   NaN
five   2015   lee     3.0   NaN

In [61]:
#iloc

df.iloc[0, 0]

2015

In [69]:
data = {"names" : ["kim", "kim", "lee", "park", "lee"],
       "year" : [2015, 2016, 2017, 2015, 2015],
       "points" : [1.5, 2.7, 1.3, 2.6, 3.0]}

df = pd.DataFrame(data,
                 columns=["year", "names", "points", "grade"],
                 index=["one", "two", "three", "four", "five"])

# MASK
df.loc[df["points"] > 2.0, ["names", "points"]]

df.loc[df["names"] == "kim",["names", "points"]]

df.loc[(df["year"] >= 2015) & (df["points"] > 2.0)]

      year names  points grade
two   2016   kim     2.7   NaN
four  2015  park     2.6   NaN
five  2015   lee     3.0   NaN

In [95]:
df = pd.DataFrame(np.random.randn(6, 4))
df.columns = ["A", "B", "C", "D"]
df.index = pd.date_range("20190101", periods=6)
df["E"] = [3.5, np.nan, 2.0, np.nan, 1.7, np.nan]

# Nan이 있는 행 모두 삭제
df.dropna(how="any")

# Nan을 대체
df.fillna(0)

# 각 셀의 Nan 상태 체크
df.isnull()

                A      B      C      D      E
2019-01-01  False  False  False  False  False
2019-01-02  False  False  False  False   True
2019-01-03  False  False  False  False  False
2019-01-04  False  False  False  False   True
2019-01-05  False  False  False  False  False
2019-01-06  False  False  False  False   True

In [102]:
data = [[2.0, np.nan],
       [7.3, -3.1],
       [np.nan, np.nan],
       [0.55, -2.6]]

df = pd.DataFrame(data,
                 columns=["one", "two"],
                 index=["a", "b", "c", "d"])

#합
df.sum(axis=1)

df["two"].sum()  #특정열

df.loc["b"].sum() #특정행

4.199999999999999

In [136]:
data = [[2.0, np.nan],
       [7.3, -3.1],
       [np.nan, np.nan],
       [0.55, -2.6]]

df = pd.DataFrame(data,
                 columns=["one", "two"],
                 index=["a", "b", "c", "d"])

# 결측값을 다른값으로 대체
# one의 nan은 one의 평균으로
# two의 nan은 two의 최소값으로

df1 = df.fillna(0)

one_mean = df["one"].mean()
two_sum = df["two"].sum()


df["one"] = df["one"].fillna(value=df.mean(axis=0)["one"])
df["two"] = df["two"].fillna(value=df.min(axis=0)["two"])

df

        one  two
a  2.000000 -3.1
b  7.300000 -3.1
c  3.283333 -3.1
d  0.550000 -2.6

In [18]:
# 상관관계
# 수치로 계산되어 두 대상이 서로 연관성이 있다고 추측되는 관계
# 예시) 성적(정량적)과 자존감(정성적) -> 정성적인 부분을 정량적으로 표현하면 둘의 상관관계를 알 수 있음
# 예시2) 온라인 게임과 폭력성

# 상관관계를 수치화 해서 표현할 수 있음
# 상관계수 : -1 ~ 1  사이의 값으로 표현
# 0에 가까울 수록 관계 없음, 절대값이 1에 가까울 수록 관계 있음
# -1은 반비례 관계, 1은 정비례 관계
# 상관관계는 두 대상의 연관성만 추측할 수 있고 인과관계를 설명할 수 없음

import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.rand(6, 4))
df.columns = ["A", "B", "C", "D"]
df.index = pd.date_range("20190101", periods=6)

df["A"].corr(df["C"])

-0.14707695844545737

In [20]:
# 평균(mean) : 수학적 확률에 대한 기댓값
# 편차 (deviation) : 평균과 각 값들의 차이
# 분산(variance) : 각 편차의 제곱의 평균
# 표준편차(standard deviation) : 분산에 제곱근을 취함
# 공분산: 분산은 한 변수에 대해서, 두 변수를 이용해 분산처리 하는 것. 두 변수에 대한 상승 혹은 하강에 대한 경향 분석에 사용
df = pd.DataFrame(np.random.rand(6, 4))
df.columns = ["A", "B", "C", "D"]
df.index = pd.date_range("20190101", periods=6)

df.corr()

          A         B         C         D
A  1.000000  0.635574  0.535924 -0.109400
B  0.635574  1.000000  0.384466 -0.170282
C  0.535924  0.384466  1.000000  0.147776
D -0.109400 -0.170282  0.147776  1.000000

In [43]:
#DataFrame에 대한 정렬
df = pd.DataFrame(np.random.rand(6, 4))
df.columns = ["A", "B", "C", "D"]
df.index = pd.date_range("20190101", periods=6)

random_date = np.random.permutation(df.index)
random_date

df2 = df.reindex(index=random_date, columns=["B", "A", "D", "C"])
df2.sort_index(axis=0, ascending=False) # ascemding 오름차순 => False: 내림차순
df2.sort_values(by=["A"])
df2.sort_values(by=["A", "B"]) # A로 정렬한 후, A컬럼에 대해 같은 값이 있는 경우 B로 정렬

df2["E"] = ["AA", "BB", "CC", "CC", "AA", "CC"]
df2["E"].unique() # unique한 값을 도출

df2
df2["E"].value_counts() # 값의 개수

df2["E"].isin(["AA", "BB"])

#E Column의 값이 CC인 행들의 모든 열을 추출하시오
df2.loc[df2["E"].isin(["CC"]),:]

                   B         A         D         C   E
2019-01-02  0.961344  0.696537  0.837559  0.528481  CC
2019-01-06  0.805271  0.302320  0.678466  0.693184  CC
2019-01-03  0.074740  0.938284  0.126022  0.105318  CC

In [56]:
# Lending Club Data

import numpy as np
import pandas as pd

df = pd.read_csv("data/loan/LoanStats3d.csv", sep="," )

df.shape
df.columns

C:\Users\SDEDU03\AppData\Local\Continuum\anaconda3-2\envs\tensorflow_env\lib\site-packages\IPython\core\interactiveshell.py:2785: DtypeWarning: Columns (0,19,55) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

Index(['id', 'member_id', 'loan_amnt', 'funded_amnt', 'funded_amnt_inv',
       'term', 'int_rate', 'installment', 'grade', 'sub_grade',
       ...
       'hardship_payoff_balance_amount', 'hardship_last_payment_amount',
       'disbursement_method', 'debt_settlement_flag',
       'debt_settlement_flag_date', 'settlement_status', 'settlement_date',
       'settlement_amount', 'settlement_percentage', 'settlement_term'],
      dtype='object', length=145)

In [69]:
df.head()

df.tail()

df2 = df[["loan_amnt", "loan_status", "grade", "int_rate", "term"]] # 대출 금액, 대출 상태, 등급, 상환률, 기간

df2.head()


print(df2.shape)
# 결측값을 제거
print(df2.dropna(how="any").shape)
df2 = df2.dropna(how="any")

(421097, 5)
(421095, 5)

In [108]:
# 대출기간별 대출 총액을 구한다
df2.head()

# 대출기간의 종류를 땡겨옴
df2["term"].unique()
print("[대출기간의 종류]")
print(df2["term"].unique())

print("60 months: ", df2.loc[df2["term"].isin([" 60 months"]), "loan_amnt"].sum())
print("36 months: ", df2.loc[df2["term"].isin([" 36 months"]), "loan_amnt"].sum())

# 선생님 코드
loan_amount = {}
loan_term = df2["term"].unique()
for term in loan_term :
    term_sum = df2.loc[df2["term"]==term, "loan_amnt"].sum()
    loan_amount[term] = term_sum
    
loan_amount

df2.head()

# 파일 저장
df2.to_csv("result.csv", sep=",")

[대출기간의 종류]
[' 60 months' ' 36 months']
60 months:  2791147075.0
36 months:  3626461100.0

In [1]:
import tensorflow as tf